ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bcs.c
/******************************************************************************
* Function Name: Cy_BLE_BCSS_WriteEventHandler
***************************************************************************//**
*
*  Handles a Write Request event for the Body Composition Service.
*
*  \param void *eventParam - The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - The Write is successful.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - The request is not supported.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - 'handleValuePair.attrHandle' is not valid.
*   * CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED - The Write operation is not permitted on
*                                          this attribute.
*   * CY_BLE_GATT_ERR_INVALID_OFFSET - The offset value is invalid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Some other error occurred.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_BCSS_WriteEventHandler(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint32_t event = (uint32_t)CY_BLE_EVT_BCSS_INDICATION_DISABLED;

    if(Cy_BLE_BCS_ApplCallback != NULL)
    {
        /* Client Characteristic Configuration descriptor Write request */
        if(eventParam->handleValPair.attrHandle ==
           cy_ble_bcsConfigPtr->bcss->charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].descrHandle[CY_BLE_BCS_CCCD])
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };
            if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
            {
                event = (uint32_t)CY_BLE_EVT_BCSS_INDICATION_ENABLED;
            }

            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                cy_stc_ble_bcs_char_value_t wrReqParam =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT,
                    .value      = NULL
                };
                Cy_BLE_BCS_ApplCallback(event, &wrReqParam);
            }

        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            /* Set a flag to store bonding data to flash */
            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
            {
                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
            }
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

            /* Clear a callback flag indicating that the request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_BCSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles a Value Confirmation request event from the BLE stack.
*
*  \param eventParam: The pointer to a structure of type cy_stc_ble_conn_handle_t.
*
******************************************************************************/
static void Cy_BLE_BCSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    if((Cy_BLE_BCS_ApplCallback != NULL) && (cy_ble_bcssReqHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        /* Only Weight Measurement characteristic has the Indication property. Check if
         * the requested handle is the handle of the Descriptor Value Change handle.
         */
        if(cy_ble_bcssReqHandle == cy_ble_bcsConfigPtr->bcss->charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].charHandle)
        {
            /* Fill in the event data and inform Application about successfully
             * confirmed indication.
             */
            cy_stc_ble_bcs_char_value_t locCharValue =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT,
                .value      = NULL
            };
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_bcssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_BCS_ApplCallback((uint32_t)CY_BLE_EVT_BCSS_INDICATION_CONFIRMED, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BCSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a value for one of the three characteristic values of the Body Composition
*  Service. The characteristic is identified by charIndex.
*
*  \param charIndex: The index of a Body Composition Service characteristic.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*             stored to the GATT database.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was written successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BCSS_SetCharacteristicValue(cy_en_ble_bcs_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo;

    if((attrValue != NULL) && (charIndex < CY_BLE_BCS_CHAR_COUNT))
    {
        /* Fill the structure */
        if(charIndex == CY_BLE_BCS_BODY_COMPOSITION_FEATURE)
        {
            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_bcsConfigPtr->
                                                        bcss->charInfo[CY_BLE_BCS_BODY_COMPOSITION_FEATURE].charHandle;
        }
        else
        {
            dbAttrValInfo.handleValuePair.attrHandle = cy_ble_bcsConfigPtr->
                                                        bcss->charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].charHandle;
        }
        dbAttrValInfo.handleValuePair.value.len = attrSize;
        dbAttrValInfo.handleValuePair.value.val = attrValue;
        dbAttrValInfo.offset = 0u;
        dbAttrValInfo.flags = CY_BLE_GATT_DB_LOCALLY_INITIATED;
        if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
        {
            /* Indicate success */
            apiResult = CY_BLE_SUCCESS;
        }
    }

    /* Return a status */
    return(apiResult);
}


