ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bcs.c
/******************************************************************************s
* Function Name: Cy_BLE_BCSC_DiscoverCharDescriptorsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_FIND_INFO_RSP event.
*  Based on the descriptor UUID, the appropriate data structure is populated using
*  the data received as part of the callback.
*
*  \param discDescrInfo: The pointer to a descriptor information structure.
*
******************************************************************************/
static void Cy_BLE_BCSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discDescrInfo->connHandle);

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_BCS)
    {
        if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_CLIENT_CONFIG)
        {
            if(cy_ble_bcsc[discIdx].bodyCompositionMeasurementCccdHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                cy_ble_bcsc[discIdx].bodyCompositionMeasurementCccdHandle = discDescrInfo->descrHandle;
            }
            else    /* Duplication of the descriptor */
            {
                Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DESCR_DUPLICATION, &discDescrInfo);
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}

/******************************************************************************
* Function Name: Cy_BLE_BCSC_GetCharRange
***************************************************************************//**
*
* Returns a possible range of the current characteristic descriptor via
* input parameter charRangeInfo->range
*
* \param *charRangeInfo: The pointer to a descriptor range information structure.
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_BCSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(charRangeInfo->connHandle);

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_BCS)
    {
        if(charRangeInfo->srviIncIdx != CY_BLE_DISCOVERY_INIT)
        {
            cy_ble_discovery[discIdx].charCount++;
        }

        if(cy_ble_discovery[discIdx].charCount == 0u)
        {
            charRangeInfo->range.startHandle = cy_ble_bcsc[discIdx].charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].
                                                valueHandle + 1u;
            charRangeInfo->range.endHandle = cy_ble_bcsc[discIdx].charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].
                                              endHandle;
        }
        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}

/******************************************************************************
* Function Name: Cy_BLE_BCSC_IndicationEventHandler
***************************************************************************//**
*
*  Handles an Indication event for the Body Composition Service.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BCSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BCS_ApplCallback != NULL))
    {
        if(cy_ble_bcsc[discIdx].charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].valueHandle ==
           eventParam->handleValPair.attrHandle)
        {
            cy_stc_ble_bcs_char_value_t indicationValue =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT,
                .value      = &eventParam->handleValPair.value
            };
            Cy_BLE_BCS_ApplCallback((uint32_t)CY_BLE_EVT_BCSC_INDICATION, &indicationValue);
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BCSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles a Read Response event for the Body Composition Service.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BCSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t locReqHandle = 1u;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BCS_ApplCallback != NULL) &&
       (cy_ble_bcscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if((cy_ble_bcscReqHandle[discIdx] ==
            cy_ble_bcsc[discIdx].charInfo[CY_BLE_BCS_BODY_COMPOSITION_FEATURE].valueHandle) ||
           (cy_ble_bcscReqHandle[discIdx] ==
            cy_ble_bcsc[discIdx].charInfo[CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT].valueHandle))
        {
            cy_stc_ble_bcs_char_value_t locCharValue = { .connHandle = eventParam->connHandle };
            if(cy_ble_bcscReqHandle[discIdx] == cy_ble_bcsc[discIdx].charInfo[CY_BLE_BCS_BODY_COMPOSITION_FEATURE].
                valueHandle)
            {
                locCharValue.charIndex = CY_BLE_BCS_BODY_COMPOSITION_FEATURE;
            }
            else
            {
                locCharValue.charIndex = CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT;
            }

            locCharValue.value = &eventParam->value;
            cy_ble_bcscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_BCS_ApplCallback((uint32_t)CY_BLE_EVT_BCSC_READ_CHAR_RESPONSE, &locCharValue);
        }
        else if(cy_ble_bcscReqHandle[discIdx] == cy_ble_bcsc[discIdx].bodyCompositionMeasurementCccdHandle)
        {
            cy_stc_ble_bcs_descr_value_t locDescrValue =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_BCS_BODY_COMPOSITION_MEASUREMENT,
                .descrIndex = CY_BLE_BCS_CCCD,
                .value      = &eventParam->value
            };
            cy_ble_bcscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_BCS_ApplCallback((uint32_t)CY_BLE_EVT_BCSC_READ_DESCR_RESPONSE, &locDescrValue);
        }
        else
        {
            locReqHandle = 0u;
        }

